package saleson.shop.openmarket.domain;



public class EleventhStreet extends BaseOpenMarket {
		
	public EleventhStreet() {
		super("C", "AL", new String[]{
			"번호",			"주문상태",		"주문번호",		"주문순번",		"결제일시",
			"배송번호",		"상품명",			"옵션",			"바코드",			"판매자/공급업자",
			"수량",			"주문금액",		"수취인",			"배송방법",		"택배사코드",
			"송장번호",		"발주확인일",		"발송처리일",		"발송지연",		"예상발송일",
			"배송완료여부",		"묶음여부",		"배송주체",		"배송비결제방식",	"배송비",
			"도서산간 배송비",	"배송비쿠폰",		"고객결제배송비",	"휴대폰번호",		"전화번호",
			"우편번호",		"주소",			"배송메시지",		"구매자",			"구매자ID",
			"판매방식",		"상품번호",		"판매자 상품코드",	"판매단가",		"옵션가",
			"판매자기본할인금액",	"판매자 추가할인금액","서비스이용료 정책","기본서비스이용료(율)","서비스이용료(%)",
			"정산예정금액",		"주문일시",		"추가구성여부",		"송장수정일시",		"구매확정요청처리여부",
			"구매확정요청불가사유","출고지명",		"복수구매할인금액",	"전고객할인금액",	"T멤버십사용금액",
			"재고번호",		"고객등급",		"전세계배송",		"바코드 출력여부",	"전세계배송 수취인",
			"전세계배송 연락처1","전세계배송 연락처2","전세계배송 Zip Code","전세계배송 Address","영문상품명",
			"11stPay 거래",	"도서산간배송비결제방식"
		});
	}
}


