package saleson.shop.openmarket.domain;



public class Gmarket extends BaseOpenMarket {
		
	public Gmarket() {
		super("Y", "AD", new String[]{
			"아이디", "상품번호", "주문번호", "주문일자(결제확인전)", "판매금액", "판매단가", "구매자명", "구매자ID", "상품명", "수량",
			"주문옵션", "추가구성", "사은품", "수령인명", "수령인 휴대폰", "수령인 전화번호", "우편번호", "주소", "배송시 요구사항", "배송번호",
			"배송비", "배송비 금액", "택배사명(발송방법)", "송장번호", "장바구니번호(결제번호)", "구매자 휴대폰", "구매자 전화번호", "발송예정일", "배송지연사유", "판매자 관리코드",
			"판매자 상세관리코드", "주문확인일자", "서비스이용료", "정산예정금액",  "판매자쿠폰할인", "판매자포인트적립", "일시불할인", "(옥션)복수구매할인", "(옥션)우수회원할인", "판매방식",
			"결제완료일", "구매쿠폰적용금액", "주문종류", "SKU번호 및 수량"
			
		});
	}
}


