package saleson.shop.openmarket.domain;

public class Naver extends BaseOpenMarket {
	
	public Naver() {
		super("D", "O", new String[]{
			"결제위치", "주문유형", "상품주문번호", "주문번호", "구매자명", "구매자ID", "수취인명", "주문상태",
			"주문세부상태", "결제일", "배송방법", "택배사", "송장번호", "발송일", "상품번호", "상품명", "상품종류",
			"옵션정보", "옵션코드", "수량", "상품가격", "옵션가격", "상품별 할인액", "가맹점 부담 할인액", "상품별 총 주문금액",
			"발주확인일", "발송기한", "발송처리일", "송장출력일", "배송비 형태", "배송비 유형", "배송비 합계", "배송비 할인액",
			"수취인연락처1", "수취인연락처2", "배송지", "구매자연락처", "우편번호", "배송메세지", "몰관리코드", "결제 구분",
			"결제수단", "주문 할인액", "일반 결제수단 결제액", "네이버 마일리지 결제액", "(구)체크아웃 적립금 결제액",
			"환불정산액 결제액", "매출코드", "결제수수료", "정산예정금액", "주문추가정보", "결제번호", "주문일시", 
			"(수취인연락처1)", "(수취인연락처2)", "(우편번호)", "(기본주소)", "(상세주소)", "(구매자연락처)"
		});
	}
}
