package saleson.shop.openmarket.domain;



public class StoreFarm extends BaseOpenMarket {
		
	public StoreFarm() {
		super("D", "AK", new String[]{
			"결제위치", "판매채널", "상품주문번호", "주문번호", "구매자명", "구매자ID", "수취인명", "주문상태", "주문세부상태", "결제일",
			"배송방법", "택배사", "송장번호", "발송일", "상품번호", "상품명", "상품종류", "옵션정보", "옵션관리코드", "수량" ,
			"옵션가격", "상품가격", "상품별 할인액", "판매자 부담 할인액", "상품별 총 주문금액", "사은품", "발주확인일", "발송기한", "발송처리일", "송장출력일",
			"배송비 형태", "배송비 묶음번호", "배송비 유형", "배송비 합계", "지역별 배송비", "배송비 할인액", "판매자 상품코드", "수취인연락처1", "수취인연락처2", "배송지",
			"구매자연락처", "우편번호", "배송메세지", "출고지", "결제수단", "수수료 과금구분", "수수료결제방식", "결제수수료", "채널수수료", "지식쇼핑 매출연동 수수료",
			"(구)판매수수료", "정산예정금액", "유입경로", "구매자 주민등록번호", "개인통관고유부호", "주문일시", "(수취인연락처1)", "(수취인연락처2)", "(우편번호)", "(기본주소)"
			,"(상세주소)", "(구매자연락처)"
					
		});
	}
}


